[{"uuid":"0000010010","start_date":"Jun, 2025","name":"MockAPI – Dynamic API Response Server","more_info":"https://mockapi.vishaldas.in/","end_date":"","descrption":"MockAPI is a lightweight Spring Boot application that dynamically serves mocked API responses based on request UUID and path. It enables developers and testers to simulate backend behavior for various endpoints without needing full backend logic. Please register its FREE!"},{"uuid":"0000010009","start_date":"Feb, 2025","name":"Portfolio App","more_info":"https://github.com/Vishal-skywalker/profile-react-app","end_date":"","descrption":"A sleek project and portfolio dashboard built with React and Tailwind CSS, featuring tab-based navigation, API-driven data, and automatic caching via React Query. It includes responsive design, skeleton loading, and seamless state management — perfect for showcasing personal projects or team achievements with a modern, dynamic interface. 🚀\r\nRecently improved performance by more than 90%, from 20+ seconds (first request) to less than 2 seconds. Checkout the repo if you want to know how."},{"uuid":"0000010008","start_date":"May, 2024","name":"Apex Helper - Formatter (VS Code Extension)","more_info":"https://marketplace.visualstudio.com/items?itemName=VishalSkywalker.apex-helper","end_date":"Jun, 2025","descrption":"Created a VS code extension for formatting APEX code without using the CLI tool, and used the formatting API feature from VS code. Later added a comment adder command to add comments to methods and classes. I collaborated with one other developer on this project."},{"uuid":"0000010007","start_date":"Jul, 2024","name":"Portfolio Server (Personal)","more_info":"https://portfolio.vishaldas.in/docs","end_date":"Feb, 2025","descrption":"Used node js and salesforce to create a server to expose my project works, used swagger to show the APIs."},{"uuid":"0000010006","start_date":"Apr, 2024","name":"Custom passwordless login for Salesforce community","more_info":null,"end_date":"Jul, 2024","descrption":"Created a custom passwordless login solution using JWT and marketing cloud integration (to send SMS)."},{"uuid":"0000010005","start_date":"Feb, 2024","name":"Social Login","more_info":null,"end_date":"Apr, 2024","descrption":"Created a robust social login solution for Customer community users, the project gave an ability to add and remove different social options for various customers. Also extended the Social linking process to have the ability to capture social data such as names and avatar URLs."},{"uuid":"0000010004","start_date":"Aug, 2023","name":"Rest Resource migration (Legacy to SF)","more_info":null,"end_date":"Feb, 2024","descrption":"Created complex data model and exposed them via various Apex rest resource."},{"uuid":"0000010003","start_date":"Apr, 2023","name":"IDP","more_info":null,"end_date":"Aug, 2023","descrption":"Spearheaded Identity Provider (IDP) solutions in Salesforce Community Development for a multi-million-dollar enterprise."},{"uuid":"0000010002","start_date":"Apr, 2023","name":"Short URL service","more_info":null,"end_date":"Jun, 2023","descrption":"Created a short URL service on top of the Salesforce community using Visualforce, apex, and a few custom objects."},{"uuid":"0000010001","start_date":"Aug, 2022","name":"Quote Refinement Engine","more_info":null,"end_date":"Apr, 2023","descrption":"Engineered a robust quoting solution, streamlining multiple quote creations and automating the seamless transition from quote to contract."},{"uuid":"0000010000","start_date":"Apr, 2022","name":"Customer Plan Management (Admin)","more_info":null,"end_date":"Aug, 2022","descrption":"Created data model for managing customer plans and generating bills, used flows and approval process for most of the automation. Created custom forms using screen flows to ease the sales process."}]